# Manipolazione di un dataset

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'Names': ['Simon', 'Kate', 'Francis', 'Laura', 'Mary', 'Julian', 'Rosie', 'Simon', 'Laura'],
                   'Height':[180, 165, 170, 164, 163, 175, 166, 180, 164],
                   'Weight':[85, 65, 68, 45, 43, 72, 46, 85, 45],
                   'Pref_food': ['steak', 'pizza', 'pasta', 'pizza', 'vegetables', 'steak', 'seafood', 'steak', 'pizza'],
                   'Sex': ['m','f','m','f','f','m','f', 'm', 'f']})

In [3]:
df1

     Names  Height  Weight   Pref_food Sex
0    Simon     180      85       steak   m
1     Kate     165      65       pizza   f
2  Francis     170      68       pasta   m
3    Laura     164      45       pizza   f
4     Mary     163      43  vegetables   f
5   Julian     175      72       steak   m
6    Rosie     166      46     seafood   f
7    Simon     180      85       steak   m
8    Laura     164      45       pizza   f

In [ ]:
df1=df1[df1.Height>170]

In [ ]:
df1

In [ ]:
print(df1)

In [ ]:
# riordiniamo le colonne

In [ ]:
help(pd.DataFrame)

In [4]:
df1 = pd.DataFrame({'Names': ['Simon', 'Kate', 'Francis', 'Laura', 'Laura', 'Julian', 'Rosie', 'Simon', 'Laura'],
                   'Height':[180, 165, 170, 164, 163, 175, 166, 180, 164],
                   'Weight':[85, 65, 68, 45, 43, 72, 46, 85, 45],
                   'Pref_food': ['steak', 'pizza', 'pasta', 'pizza', 'vegetables', 'steak', 'seafood', 'steak', 'pizza'],
                   'Sex': ['m','f','m','f','f','m','f', 'm', 'f']}, columns = ['Names','Height',  'Weight', 'Pref_food', 'Sex'])

In [5]:
print(df1)

     Names  Height  Weight   Pref_food Sex
0    Simon     180      85       steak   m
1     Kate     165      65       pizza   f
2  Francis     170      68       pasta   m
3    Laura     164      45       pizza   f
4    Laura     163      43  vegetables   f
5   Julian     175      72       steak   m
6    Rosie     166      46     seafood   f
7    Simon     180      85       steak   m
8    Laura     164      45       pizza   f

In [ ]:
# oppure procediamo senza aggiungere i nomi delle colonne in questo modo

df1 = df1.reindex(columns= ['Names', 'Height', 'Weight', 'Pref_food', 'Sex'], axis=1)

In [ ]:
print(df1)

In [6]:
# oppure

df1 = df1[['Names', 'Height', 'Weight', 'Pref_food']] ##manca qualcosa!!

In [8]:
df1[['Names', 'Height', 'Weight', 'Pref_food']] ##stampa soltanto

     Names  Height  Weight   Pref_food
0    Simon     180      85       steak
1     Kate     165      65       pizza
2  Francis     170      68       pasta
3    Laura     164      45       pizza
4    Laura     163      43  vegetables
5   Julian     175      72       steak
6    Rosie     166      46     seafood
7    Simon     180      85       steak
8    Laura     164      45       pizza

In [9]:
df1[['Names', 'Height', 'Pref_food', 'Weight']] ##stampa soltanto cambiando l'ordine

     Names  Height   Pref_food  Weight
0    Simon     180       steak      85
1     Kate     165       pizza      65
2  Francis     170       pasta      68
3    Laura     164       pizza      45
4    Laura     163  vegetables      43
5   Julian     175       steak      72
6    Rosie     166     seafood      46
7    Simon     180       steak      85
8    Laura     164       pizza      45

In [7]:
print(df1)

     Names  Height  Weight   Pref_food
0    Simon     180      85       steak
1     Kate     165      65       pizza
2  Francis     170      68       pasta
3    Laura     164      45       pizza
4    Laura     163      43  vegetables
5   Julian     175      72       steak
6    Rosie     166      46     seafood
7    Simon     180      85       steak
8    Laura     164      45       pizza

In [ ]:
# procediamo con la funzione describe() che ci fornisce alcune informazioni sui nostri dati

In [10]:
df1.describe().round()   ## round arrotonda

       Height  Weight
count     9.0     9.0
mean    170.0    62.0
std       7.0    17.0
min     163.0    43.0
25%     164.0    45.0
50%     166.0    65.0
75%     175.0    72.0
max     180.0    85.0

In [ ]:
print(df1)

In [ ]:
df1

In [13]:
df1.describe()

           Height     Weight
count    9.000000   9.000000
mean   169.666667  61.555556
std      6.946222  17.306871
min    163.000000  43.000000
25%    164.000000  45.000000
50%    166.000000  65.000000
75%    175.000000  72.000000
max    180.000000  85.000000

In [12]:
df1.dtypes

Names        object
Height        int64
Weight        int64
Pref_food    object
dtype: object

In [11]:
df1.shape ## righe - colonne

(9, 4)

In [ ]:
df1.info()

In [ ]:
print(df1)

In [ ]:
df1.set_index('Names')

In [ ]:
df1.set_index('Names', inplace = True)

In [14]:
df1.sort_values(by = 'Weight')

     Names  Height  Weight   Pref_food
4    Laura     163      43  vegetables
3    Laura     164      45       pizza
8    Laura     164      45       pizza
6    Rosie     166      46     seafood
1     Kate     165      65       pizza
2  Francis     170      68       pasta
5   Julian     175      72       steak
0    Simon     180      85       steak
7    Simon     180      85       steak

In [ ]:
# slicing

In [15]:
df1[:3]

     Names  Height  Weight Pref_food
0    Simon     180      85     steak
1     Kate     165      65     pizza
2  Francis     170      68     pasta

In [ ]:
df1[1] ##non funzionerà , da errore

In [ ]:
df1[2:]

In [ ]:
# .loc .iloc .ix

In [ ]:
# .loc

In [16]:
df1 = pd.DataFrame({'Names': ['Simon', 'Kate', 'Francis', 'Laura', 'Mary', 'Julian', 'Rosie', 'Simon', 'Laura'],
                   'Height':[180, 165, 170, 164, 163, 175, 166, 180, 164],
                   'Weight':[85, 65, 68, 45, 43, 72, 46, 85, 45],
                   'Pref_food': ['steak', 'pizza', 'pasta', 'pizza', 'vegetables', 'steak', 'seafood', 'steak', 'pizza'],
                   'Sex': ['m','f','m','f','f','m','f', 'm', 'f']})

In [ ]:
df1

In [17]:
df1.loc[1] ##per scegliere una singola riga

Names         Kate
Height         165
Weight          65
Pref_food    pizza
Sex              f
Name: 1, dtype: object

In [ ]:
df1.loc[0]

In [18]:
df1.loc[:3]

     Names  Height  Weight Pref_food Sex
0    Simon     180      85     steak   m
1     Kate     165      65     pizza   f
2  Francis     170      68     pasta   m
3    Laura     164      45     pizza   f

In [ ]:
# iloc

In [ ]:
df1.iloc[1, 2]

In [ ]:
print(df1)

In [ ]:
# .ix

In [ ]:
df1.ix[0:2, :]

In [ ]:
df1.ix[: , 0:2]

In [ ]:
# condizioni di estrazione

In [19]:
df1[df1.Height > 170]

    Names  Height  Weight Pref_food Sex
0   Simon     180      85     steak   m
5  Julian     175      72     steak   m
7   Simon     180      85     steak   m

In [ ]:
df1.Height

In [20]:
df1[df1.Sex == "m"] ##prende solo i m

     Names  Height  Weight Pref_food Sex
0    Simon     180      85     steak   m
2  Francis     170      68     pasta   m
5   Julian     175      72     steak   m
7    Simon     180      85     steak   m

In [21]:
df1["new_col"] = df1.Height/100 ##per creare una nuova colonna , attenzione a quante volte viene ripetuto

In [22]:
print(df1)

     Names  Height  Weight   Pref_food Sex  new_col
0    Simon     180      85       steak   m     1.80
1     Kate     165      65       pizza   f     1.65
2  Francis     170      68       pasta   m     1.70
3    Laura     164      45       pizza   f     1.64
4     Mary     163      43  vegetables   f     1.63
5   Julian     175      72       steak   m     1.75
6    Rosie     166      46     seafood   f     1.66
7    Simon     180      85       steak   m     1.80
8    Laura     164      45       pizza   f     1.64

In [28]:
df1=df1.drop(['new_col'], axis=1)

In [30]:
df1

     Names  Height  Weight   Pref_food Sex
0    Simon     180      85       steak   m
1     Kate     165      65       pizza   f
2  Francis     170      68       pasta   m
3    Laura     164      45       pizza   f
4     Mary     163      43  vegetables   f
5   Julian     175      72       steak   m
6    Rosie     166      46     seafood   f
7    Simon     180      85       steak   m
8    Laura     164      45       pizza   f

In [31]:
g1 = df1.groupby('Sex') ##raggruppa per gruppi con lo stesso valore di Sex

In [39]:
type(g1)

pandas.core.groupby.generic.DataFrameGroupBy

In [32]:
g1.groups

{'f': [1, 3, 4, 6, 8], 'm': [0, 2, 5, 7]}

In [33]:
g2 = df1.groupby('Pref_food')

In [34]:
g2.groups

{'pasta': [2], 'pizza': [1, 3, 8], 'seafood': [6], 'steak': [0, 5, 7], 'vegetables': [4]}

In [35]:
g1.describe()

    Height                                                       Weight        \
     count    mean       std    min     25%    50%    75%    max  count  mean
Sex
f      5.0  164.40  1.140175  163.0  164.00  164.0  165.0  166.0    5.0  48.8
m      4.0  176.25  4.787136  170.0  173.75  177.5  180.0  180.0    4.0  77.5


          std   min   25%   50%   75%   max
Sex
f    9.121403  43.0  45.0  45.0  46.0  65.0
m    8.812869  68.0  71.0  78.5  85.0  85.0

In [37]:
g1.describe().transpose().round()

Sex               f      m
Height count    5.0    4.0
       mean   164.0  176.0
       std      1.0    5.0
       min    163.0  170.0
       25%    164.0  174.0
       50%    164.0  178.0
       75%    165.0  180.0
       max    166.0  180.0
Weight count    5.0    4.0
       mean    49.0   78.0
       std      9.0    9.0
       min     43.0   68.0
       25%     45.0   71.0
       50%     45.0   78.0
       75%     46.0   85.0
       max     65.0   85.0

In [42]:
g2.describe().transpose().round()

Pref_food     pasta  pizza  seafood  steak  vegetables
Height count    1.0    3.0      1.0    3.0         1.0
       mean   170.0  164.0    166.0  178.0       163.0
       std      NaN    1.0      NaN    3.0         NaN
       min    170.0  164.0    166.0  175.0       163.0
       25%    170.0  164.0    166.0  178.0       163.0
       50%    170.0  164.0    166.0  180.0       163.0
       75%    170.0  164.0    166.0  180.0       163.0
       max    170.0  165.0    166.0  180.0       163.0
Weight count    1.0    3.0      1.0    3.0         1.0
       mean    68.0   52.0     46.0   81.0        43.0
       std      NaN   12.0      NaN    8.0         NaN
       min     68.0   45.0     46.0   72.0        43.0
       25%     68.0   45.0     46.0   78.0        43.0
       50%     68.0   45.0     46.0   85.0        43.0
       75%     68.0   55.0     46.0   85.0        43.0
       max     68.0   65.0     46.0   85.0        43.0

In [ ]:
print(df1)

In [52]:
df_dummy = pd.get_dummies(df1['Sex'], prefix = 'Sex')

print(df_dummy)

   Sex_f  Sex_m
0  False   True
1   True  False
2  False   True
3   True  False
4   True  False
5  False   True
6   True  False
7  False   True
8   True  False

In [53]:
df1= df1.join(df_dummy)

In [54]:
df1

     Names  Height  Weight   Pref_food Sex  Sex_f  Sex_m
0    Simon     180      85       steak   m  False   True
1     Kate     165      65       pizza   f   True  False
2  Francis     170      68       pasta   m  False   True
3    Laura     164      45       pizza   f   True  False
4     Mary     163      43  vegetables   f   True  False
5   Julian     175      72       steak   m  False   True
6    Rosie     166      46     seafood   f   True  False
7    Simon     180      85       steak   m  False   True
8    Laura     164      45       pizza   f   True  False

In [56]:
del df1['Sex_m'] ##elimina una colonna
del df1['Sex_f']

In [57]:
print(df1)

     Names  Height  Weight   Pref_food Sex
0    Simon     180      85       steak   m
1     Kate     165      65       pizza   f
2  Francis     170      68       pasta   m
3    Laura     164      45       pizza   f
4     Mary     163      43  vegetables   f
5   Julian     175      72       steak   m
6    Rosie     166      46     seafood   f
7    Simon     180      85       steak   m
8    Laura     164      45       pizza   f

In [58]:
df1.duplicated() ##per visualizzare i duplicati , ma mette a true solo effettivamente la posizione del secondo duplicato

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8     True
dtype: bool

In [59]:
df2 = df1.drop_duplicates() ##per eliminare i duplicati

In [60]:
print(df2)

     Names  Height  Weight   Pref_food Sex
0    Simon     180      85       steak   m
1     Kate     165      65       pizza   f
2  Francis     170      68       pasta   m
3    Laura     164      45       pizza   f
4     Mary     163      43  vegetables   f
5   Julian     175      72       steak   m
6    Rosie     166      46     seafood   f

In [ ]:
df2.stack()

In [ ]:
s1 = df2.stack()

In [ ]:
s1.unstack()E

In [ ]:
pd.melt(df2)

In [ ]:
print(df1)

In [ ]:
df1.T   ##transposeE

In [66]:
df2.sample(3)

    Names  Height  Weight Pref_food Sex
0   Simon     180      85     steak   m
3   Laura     164      45     pizza   f
5  Julian     175      72     steak   m

In [67]:
import numpy as np

In [68]:
np.random.seed(1)
df1.sample(2)

     Names  Height  Weight Pref_food Sex
8    Laura     164      45     pizza   f
2  Francis     170      68     pasta   m

In [69]:
np.random.seed(2)
df1.sample(2)

  Names  Height  Weight   Pref_food Sex
4  Mary     163      43  vegetables   f
1  Kate     165      65       pizza   f

In [70]:
df1.sample(frac= 0.3) ##prende una frazione

   Names  Height  Weight   Pref_food Sex
7  Simon     180      85       steak   m
4   Mary     163      43  vegetables   f
6  Rosie     166      46     seafood   f

In [71]:
df_missing = pd.read_csv("df_missing.csv")

In [72]:
print(df_missing)

    A     B     C      D   E
0  15  96.0  74.0   31.0  50
1  41  27.0  74.0  279.0  57
2  21  32.0   NaN   99.0  96
3  48  97.0  50.0    NaN  69
4  63  98.0  74.0   44.0  55
5  43  11.0  80.0   74.0  33
6  39  38.0  81.0   20.0  41
7  58  31.0   NaN   76.0  91
8  85  94.0  37.0   65.0  60
9  98   NaN  19.0   43.0  32

In [73]:
df_missing.dropna().shape

(6, 5)

In [74]:
pd.isnull(df_missing)

       A      B      C      D      E
0  False  False  False  False  False
1  False  False  False  False  False
2  False  False   True  False  False
3  False  False  False   True  False
4  False  False  False  False  False
5  False  False  False  False  False
6  False  False  False  False  False
7  False  False   True  False  False
8  False  False  False  False  False
9  False   True  False  False  False

In [75]:
pd.notnull(df_missing)

      A      B      C      D     E
0  True   True   True   True  True
1  True   True   True   True  True
2  True   True  False   True  True
3  True   True   True  False  True
4  True   True   True   True  True
5  True   True   True   True  True
6  True   True   True   True  True
7  True   True  False   True  True
8  True   True   True   True  True
9  True  False   True   True  True

In [76]:
df_missing.dropna()

    A     B     C      D   E
0  15  96.0  74.0   31.0  50
1  41  27.0  74.0  279.0  57
4  63  98.0  74.0   44.0  55
5  43  11.0  80.0   74.0  33
6  39  38.0  81.0   20.0  41
8  85  94.0  37.0   65.0  60

In [77]:
df_missing.dropna(axis = 1, how = "any")

    A   E
0  15  50
1  41  57
2  21  96
3  48  69
4  63  55
5  43  33
6  39  41
7  58  91
8  85  60
9  98  32

In [78]:
print(df_missing)

    A     B     C      D   E
0  15  96.0  74.0   31.0  50
1  41  27.0  74.0  279.0  57
2  21  32.0   NaN   99.0  96
3  48  97.0  50.0    NaN  69
4  63  98.0  74.0   44.0  55
5  43  11.0  80.0   74.0  33
6  39  38.0  81.0   20.0  41
7  58  31.0   NaN   76.0  91
8  85  94.0  37.0   65.0  60
9  98   NaN  19.0   43.0  32

In [79]:
df_missing.fillna(0)

    A     B     C      D   E
0  15  96.0  74.0   31.0  50
1  41  27.0  74.0  279.0  57
2  21  32.0   0.0   99.0  96
3  48  97.0  50.0    0.0  69
4  63  98.0  74.0   44.0  55
5  43  11.0  80.0   74.0  33
6  39  38.0  81.0   20.0  41
7  58  31.0   0.0   76.0  91
8  85  94.0  37.0   65.0  60
9  98   0.0  19.0   43.0  32

In [80]:
df_missing.fillna('missing')

    A        B        C        D   E
0  15     96.0     74.0     31.0  50
1  41     27.0     74.0    279.0  57
2  21     32.0  missing     99.0  96
3  48     97.0     50.0  missing  69
4  63     98.0     74.0     44.0  55
5  43     11.0     80.0     74.0  33
6  39     38.0     81.0     20.0  41
7  58     31.0  missing     76.0  91
8  85     94.0     37.0     65.0  60
9  98  missing     19.0     43.0  32

In [ ]:
df_missing.fillna(df_missing.mean())

In [ ]:
df_missing['C'].fillna(df_missing['C'].mean())

In [ ]:
df_missing['C'].fillna(method = 'ffill')

In [ ]:
df_missing['C'].fillna(method = 'backfill')

In [ ]:
-cosa c è dentro quel database
dimensioni quanti record, quali etichette

Per i caratteri quuantitativi 
.describe()
    e anche qualche groupby interessante

PLOTTARE